# IFC_DMAddEntry

## Description
Adds an entry to indicated object from current IFC Data Mapping.

```pascal
FUNCTION IFC_DMAddEntry(
				inStrObjName   : STRING;
				inStrEntryName : STRING;
				bEnable        : BOOLEAN) : BOOLEAN;
```

```python

def vs.IFC_DMAddEntry(inStrObjName, inStrEntryName, bEnable):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrObjName|STRING||
|inStrEntryName|STRING||
|bEnable|BOOLEAN||

## Version
Availability: from Vectorworks 2017
## Category
* IFC